clc;clear ;close all;
i = 0;
while(i == 0)
    n=50;%仿真时间
    range=[-1000 1000;-1000 1000];
    A=[1 1 0 0;0 1 0 0;0 0 1 1;0 0 0 1];
    B=[0.5 0;1 0;0 0.5;0 1];
    C=[1 0 0 0;0 0 1 0];
    B0=diag([100 25 100 25]);
    Q=[4 0;0 4];%噪声过程的协方差阵
    q_std=sqrt(Q);%噪声过程的标准差阵
    %-----------定义矩阵含义-------------
    X1=zeros(4,n);%目标1的真实状态
    X2=zeros(4,n);%目标2的真实状态
    X3=zeros(4,n);%目标3的真实状态
    %------------初始化3个目标的状态----
    X1(:,1)=[-900;30;900;-30];
    X2(:,1)=[-900;25;-800;30];
    X3(:,1)=[-900;20;0;20];
    for k=1:n-1
        X1(:,k+1)=A*X1(:,k)+B*(q_std*randn(2,1));
        X2(:,k+1)=A*X2(:,k)+B*(q_std*randn(2,1));
        X3(:,k+1)=A*X3(:,k)+B*(q_std*randn(2,1));
    end
    if X1(1,n) < 1000 && X1(3,n) < 1000 && X2(1,n) < 1000 && X2(3,n) < 1000 && X3(1,n) < 1000 && X3(3,n) < 1000 ...
            && X1(1,n) >-1000 && X1(3,n) >-1000 && X2(1,n) >-1000 && X2(3,n) >-1000 && X3(1,n) >-1000 && X3(3,n) >-1000
        i = 1;
    else
        i = 0;
    end
end
save('real_track','X1','X2','X3')
figure;hold on;
plot(X1(1,2:k+1),X1(3,2:k+1),'-r','LineWidth',1.6);
plot(X2(1,2:k+1),X2(3,2:k+1),'--g','LineWidth',1.6);
plot(X3(1,2:k+1),X3(3,2:k+1),':b','LineWidth',1.6);
xlabel('X/m','fontsize',10);ylabel('Y/m','fontsize',10);
legend('目标1真实轨迹','目标2真实轨迹','目标3真实轨迹');
hold off;

